bdbm_drv_new_version/run/fio/log/old_version/fio_NO_FLUSH_iops/2_fio_b1024.txt
fio2: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio2: Laying out IO file(s) (1 file(s) / 1000MiB)

fio2: (groupid=0, jobs=1): err= 0: pid=11461: Tue Mar  7 20:39:24 2017
  write: IOPS=34.6k, BW=133MiB/s (139MB/s)(1000MiB/7528msec)
    slat (usec): min=6, max=15099, avg=28.53, stdev=67.45
    clat (usec): min=1, max=18795, avg=3733.87, stdev=1364.45
     lat (usec): min=10, max=18829, avg=3762.40, stdev=1373.28
    clat percentiles (usec):
     |  1.00th=[ 1176],  5.00th=[ 1176], 10.00th=[ 1608], 20.00th=[ 2672],
     | 30.00th=[ 3536], 40.00th=[ 3568], 50.00th=[ 3600], 60.00th=[ 3920],
     | 70.00th=[ 4576], 80.00th=[ 4640], 90.00th=[ 4768], 95.00th=[ 5152],
     | 99.00th=[ 8160], 99.50th=[ 8256], 99.90th=[ 9536], 99.95th=[15808],
     | 99.99th=[18816]
    lat (usec) : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=11.07%, 4=49.47%, 10=39.31%, 20=0.10%
  cpu          : usr=3.93%, sys=39.64%, ctx=303144, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=133MiB/s (139MB/s), 133MiB/s-133MiB/s (139MB/s-139MB/s), io=1000MiB (1049MB), run=7528-7528msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%