bdbm_drv_new_version/run/fio/log/old_version/fio_NO_FLUSH_iops/3_fio_b1024.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=11451: Tue Mar  7 20:39:24 2017
  write: IOPS=23.9k, BW=93.3MiB/s (97.8MB/s)(1000MiB/10723msec)
    slat (usec): min=6, max=5425, avg=40.97, stdev=92.64
    clat (usec): min=1, max=21136, avg=5316.99, stdev=2840.53
     lat (usec): min=19, max=21275, avg=5357.95, stdev=2860.94
    clat percentiles (usec):
     |  1.00th=[ 2352],  5.00th=[ 3440], 10.00th=[ 3536], 20.00th=[ 3568],
     | 30.00th=[ 3600], 40.00th=[ 3728], 50.00th=[ 4576], 60.00th=[ 4640],
     | 70.00th=[ 4768], 80.00th=[ 5920], 90.00th=[10176], 95.00th=[12608],
     | 99.00th=[15168], 99.50th=[16192], 99.90th=[17536], 99.95th=[18304],
     | 99.99th=[19840]
    lat (usec) : 2=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.44%, 4=41.54%, 10=47.73%, 20=10.27%, 50=0.01%
  cpu          : usr=2.65%, sys=29.43%, ctx=328712, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=93.3MiB/s (97.8MB/s), 93.3MiB/s-93.3MiB/s (97.8MB/s-97.8MB/s), io=1000MiB (1049MB), run=10723-10723msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%