bdbm_drv_new_version/run/fio/log/old_version/fio_NO_FLUSH_iops/3_fio_b2048.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=21731: Tue Mar  7 19:33:56 2017
  write: IOPS=135k, BW=527MiB/s (553MB/s)(1000MiB/1897msec)
    slat (usec): min=2, max=20234, avg= 6.86, stdev=68.22
    clat (usec): min=1, max=24409, avg=940.99, stdev=1282.19
     lat (usec): min=4, max=24423, avg=947.85, stdev=1289.47
    clat percentiles (usec):
     |  1.00th=[  458],  5.00th=[  466], 10.00th=[  470], 20.00th=[  474],
     | 30.00th=[  482], 40.00th=[  490], 50.00th=[  498], 60.00th=[  516],
     | 70.00th=[  596], 80.00th=[  660], 90.00th=[ 2288], 95.00th=[ 3792],
     | 99.00th=[ 6240], 99.50th=[ 7264], 99.90th=[10176], 99.95th=[12480],
     | 99.99th=[24192]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.02%, 500=52.04%, 750=31.01%, 1000=2.91%
    lat (msec) : 2=3.20%, 4=6.58%, 10=4.13%, 20=0.06%, 50=0.05%
  cpu          : usr=7.17%, sys=49.37%, ctx=9514, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=527MiB/s (553MB/s), 527MiB/s-527MiB/s (553MB/s-553MB/s), io=1000MiB (1049MB), run=1897-1897msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%