bdbm_drv_new_version/run/fio/log/old_version/fio_NO_FLUSH_iops/3_fio_b512.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=14219: Tue Mar  7 20:41:55 2017
  write: IOPS=25.9k, BW=101MiB/s (106MB/s)(1000MiB/9904msec)
    slat (usec): min=6, max=11411, avg=37.78, stdev=107.00
    clat (usec): min=1, max=25733, avg=4909.70, stdev=2873.10
     lat (usec): min=14, max=25926, avg=4947.49, stdev=2893.75
    clat percentiles (usec):
     |  1.00th=[ 1240],  5.00th=[ 2352], 10.00th=[ 2704], 20.00th=[ 3568],
     | 30.00th=[ 3760], 40.00th=[ 3952], 50.00th=[ 4016], 60.00th=[ 4576],
     | 70.00th=[ 4960], 80.00th=[ 5152], 90.00th=[ 7712], 95.00th=[12352],
     | 99.00th=[16512], 99.50th=[17792], 99.90th=[20864], 99.95th=[23680],
     | 99.99th=[25216]
    lat (usec) : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=3.02%, 4=45.50%, 10=43.69%, 20=7.63%, 50=0.14%
  cpu          : usr=1.74%, sys=33.57%, ctx=287900, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=101MiB/s (106MB/s), 101MiB/s-101MiB/s (106MB/s-106MB/s), io=1000MiB (1049MB), run=9904-9904msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%